# Pandas - Answers to Exercise 1

In [1]:
import pandas as pd
import numpy as np

# Here is the dictionary
ftns_dict = {'Rank': {0: '1', 1: '2', 2: '3', 3: '4', 4: '5', 5: '6', 6: '7', 7: '8', 8: '9', 9: '10'},
             'Summit Name': {0: 'Mount Elbert', 1: 'Mount Massive', 2: 'Mount Harvard', 3: 'Blanca Peak', 4: 'La Plata Peak', 5: 'Uncompahgre Peak', 6: 'Crestone Peak',
                             7: 'Mount Lincoln', 8: 'Grays Peak', 9: 'Castle Peak'},
             'Range': {0: 'Sawatch', 1: 'Sawatch', 2: 'Sawatch', 3: 'Sangre de Cristo', 4: 'Sawatch', 5: 'San Juan', 6: 'Sangre de Cristo', 7: 'Tenmile-Mosquito', 8: 'Front Range', 9: 'Elk'},
             'Elevation': {0: 14438, 1: 14427, 2: 14424, 3: 14350, 4: 14344, 5: 14318, 6: 14299, 7: 14293, 8: 14275, 9: 14274},
             'Prom.': {0: 9098, 1: 1983, 2: 2340, 3: 5335, 4: 1846, 5: 4249, 6: 4584, 7: 3860, 8: 2782, 9: 2358}}

# Add your code here to read the dictionary into a dataframe called 'ft'
ft = pd.DataFrame(ftns_dict)

 1. Use the `head()` method to see what the dataframe looks like.

In [2]:
# Type your code here
ft.head()

  Rank    Summit Name             Range  Elevation  Prom.
0    1   Mount Elbert           Sawatch      14438   9098
1    2  Mount Massive           Sawatch      14427   1983
2    3  Mount Harvard           Sawatch      14424   2340
3    4    Blanca Peak  Sangre de Cristo      14350   5335
4    5  La Plata Peak           Sawatch      14344   1846

2. Use the `shape` property to see how many rows and columns there are.

In [3]:
# Type your code here
ft.shape

(10, 5)

3. Rename the `'Elevation'` column `'Elevation (ft)'` and check you've done this. Remember to use `inplace=True`.

In [4]:
 # Type your code here
ft.rename(columns={'Elevation':'Elevation (ft)'}, inplace=True)
ft

  Rank       Summit Name             Range  Elevation (ft)  Prom.
0    1      Mount Elbert           Sawatch           14438   9098
1    2     Mount Massive           Sawatch           14427   1983
2    3     Mount Harvard           Sawatch           14424   2340
3    4       Blanca Peak  Sangre de Cristo           14350   5335
4    5     La Plata Peak           Sawatch           14344   1846
5    6  Uncompahgre Peak          San Juan           14318   4249
6    7     Crestone Peak  Sangre de Cristo           14299   4584
7    8     Mount Lincoln  Tenmile-Mosquito           14293   3860
8    9        Grays Peak       Front Range           14275   2782
9   10       Castle Peak               Elk           14274   2358

4. Delete the `'Prom.'` column  and check you've done this. Make sure you use `inplace=True` to store the result back in the `ft` dataframe.

In [5]:
 # Type your code here
ft.drop(columns=['Prom.'], inplace=True)
ft

  Rank       Summit Name             Range  Elevation (ft)
0    1      Mount Elbert           Sawatch           14438
1    2     Mount Massive           Sawatch           14427
2    3     Mount Harvard           Sawatch           14424
3    4       Blanca Peak  Sangre de Cristo           14350
4    5     La Plata Peak           Sawatch           14344
5    6  Uncompahgre Peak          San Juan           14318
6    7     Crestone Peak  Sangre de Cristo           14299
7    8     Mount Lincoln  Tenmile-Mosquito           14293
8    9        Grays Peak       Front Range           14275
9   10       Castle Peak               Elk           14274

5. Create a new column called `'Elevation (m)'` that gives the elevation of each mountain in metres. Use 1 ft = 0.3048 m as your conversion factor. Check that you have made this change.

In [6]:
 # Type your code here
ft['Elevation (m)']=ft['Elevation (ft)']*0.3048
ft

  Rank       Summit Name             Range  Elevation (ft)  Elevation (m)
0    1      Mount Elbert           Sawatch           14438      4400.7024
1    2     Mount Massive           Sawatch           14427      4397.3496
2    3     Mount Harvard           Sawatch           14424      4396.4352
3    4       Blanca Peak  Sangre de Cristo           14350      4373.8800
4    5     La Plata Peak           Sawatch           14344      4372.0512
5    6  Uncompahgre Peak          San Juan           14318      4364.1264
6    7     Crestone Peak  Sangre de Cristo           14299      4358.3352
7    8     Mount Lincoln  Tenmile-Mosquito           14293      4356.5064
8    9        Grays Peak       Front Range           14275      4351.0200
9   10       Castle Peak               Elk           14274      4350.7152

6. Finally, use the `describe()` method to see a statistical summary of the data. What is the average elevation of the ten highest mountains in Colorado?

In [7]:
# Type your code here
print(f"The average elevation of these ten mountains is {ft['Elevation (ft)'].mean():.0f} feet or {ft['Elevation (m)'].mean():.0f} meters.")
ft.describe()

The average elevation of these ten mountains is 14344 feet or 4372 meters.

       Elevation (ft)  Elevation (m)
count       10.000000      10.000000
mean     14344.200000    4372.112160
std         64.224952      19.575765
min      14274.000000    4350.715200
25%      14294.500000    4356.963600
50%      14331.000000    4368.088800
75%      14405.500000    4390.796400
max      14438.000000    4400.702400

## Good Job!

You've made it to the end of the first `pandas` notebook. 

If you have time, you should start looking at the **Pandas Extension**, which is in a separate notebook.